In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one  0.425558  0.318124
1    a  two  0.292895 -1.633415
2    b  one  1.343285  1.585616
3    b  two -0.045071 -0.524769
4    a  one -0.345054  1.208500

In [3]:
grouped = df.groupby(by=["台北",'台北','台北','台中','台中'])[['data1','data2']]
grouped.min()

       data1     data2
台中 -0.345054 -0.524769
台北  0.292895 -1.633415